// Вам будет дан год, верните тот век, в котором он находится.
// Первый век охватывает период с 1 года до 100 года включительно,
// второй - с 101 года до 200 года включительно и т. д.


void main () {
  var year = 1705;
  switch (year) {
    case >= 1 && <= 100:
      print("1");
    case >= 101 && <= 200:
      print("2");
    case >= 201 && <= 300:
      print("3");
    case >= 301 && <= 400:
      print("4");
    case >= 401 && <= 500:
      print("5");
    case >= 501 && <= 600:
      print("6");
    case >= 601 && <= 700:
      print("7");
    case >= 701 && <= 800:
      print("8");
    case >= 801 && <= 900:
      print("9");
    case >= 901 && <= 1000:
      print("10");
    case >= 1001 && <= 1100:
      print("11");
    case >= 1101 && <= 1200:
      print("12");
    case >= 1201 && <= 1300:
      print("13");
    case >= 1301 && <= 1400:
      print("14");
    case >= 1401 && <= 1500:
      print("15");
    case >= 1501 && <= 1600:
      print("16");
    case >= 1601 && <= 1700:
      print("17");
    case >= 1701 && <= 1800:
      print("18");
    case >= 1801 && <= 1900:
      print("19");
    case >= 1901 && <= 2000:
      print("20");
  }
}
